app/views/articles/_article.html.erb

SELECT "contenus".* FROM "contenus" WHERE "contenus"."article_id" = $1  [["article_id", 1]]
---
<% k = 0 %>
<% @article.contenus.each do |content| %>