app/views/articles/index.html.erb

	  <% contenuRestant = 2 %>
	  <% article.contenus.each do |content| %>
---
SELECT "contenus".* FROM "contenus" WHERE "contenus"."article_id" = $1  [["article_id", 1]]