app/controllers/articles_controller.rb

		def create
			@article = Article.new(article_params)

			if params[:commit] == 'Continuer'
				if @article.save
---
INSERT INTO "articles" ("titre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["titre", "hello"], ["created_at", "2015-03-10 18:14:29.970768"], ["updated_at", "2015-03-10 18:14:29.970768"]]