app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		if params[:commit] == 'Poster'
		  @comment = @article.comments.create(commentaire_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commentateur", "commentaire", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["commentateur", "quelqu'un"], ["commentaire", "en chien"], ["article_id", 1], ["created_at", "2015-03-10 18:14:54.364585"], ["updated_at", "2015-03-10 18:14:54.364585"]]