app/controllers/contenus_controller.rb

	def create
		@article = Article.find(params[:article_id])
		if params[:commit] == 'Ajouter et continuer'
			@contenu = @article.contenus.create(contenu_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "contenus" ("texte", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["texte", "test4.jpg"], ["article_id", 1], ["created_at", "2015-03-10 18:14:37.384243"], ["updated_at", "2015-03-10 18:14:37.384243"]]

	def destroy
		@article = Article.find(params[:article_id])
		@contenu = @article.contenus.find(params[:id])
		@contenu.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "contenus".* FROM "contenus" WHERE "contenus"."article_id" = $1 AND "contenus"."id" = $2 LIMIT 1  [["article_id", 1], ["id", 2]]
DELETE FROM "contenus" WHERE "contenus"."id" = $1  [["id", 2]]